In [2]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Obtaining dependency information for mysql-connector-python from https://files.pythonhosted.org/packages/99/86/4db455855116fc9aeb801154e0ba258ac7f76ed3f1c674068ca90c65da10/mysql_connector_python-8.3.0-cp39-cp39-win_amd64.whl.metadata
  Downloading mysql_connector_python-8.3.0-cp39-cp39-win_amd64.whl.metadata (2.0 kB)
Downloading mysql_connector_python-8.3.0-cp39-cp39-win_amd64.whl (15.4 MB)
   ---------------------------------------- 15.4/15.4 MB 163.3 kB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0

WARNING: Ignoring invalid distribution -atplotlib (c:\users\aayush\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aayush\anaconda3\lib\site-packages)
WARNING: Error parsing requirements for plotly: [Errno 2] No such file or directory: 'c:\\users\\aayush\\anaconda3\\lib\\site-packages\\plotly-5.14.1.dist-info\\METADATA'
WARNING: Ignoring invalid distribution -atplotlib (c:\users\aayush\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aayush\anaconda3\lib\site-packages)

In [1]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "python8am")

db = database.cursor()

In [2]:
db.execute("SELECT * FROM student")
result =db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Ram Kumar', 78, 89, 67, 90, 67, 400, 80.0, 'A'),
 (2, 'Shyam', 78, 90, 90, 78, 80, 432, 85.0, 'A'),
 (3, 'Hari', 67, 89, 98, 67, 89, 87, 86.7, 'A')]

In [3]:
db.execute("SELECT sn,name,per,total,grade FROM student")
result =db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Ram Kumar', 80.0, 400, 'A'),
 (2, 'Shyam', 85.0, 432, 'A'),
 (3, 'Hari', 86.7, 87, 'A')]

In [4]:
db.execute("SELECT * FROM student WHERE grade = 'A'")
result =db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Ram Kumar', 78, 89, 67, 90, 67, 400, 80.0, 'A'),
 (2, 'Shyam', 78, 90, 90, 78, 80, 432, 85.0, 'A'),
 (3, 'Hari', 67, 89, 98, 67, 89, 87, 86.7, 'A')]

In [5]:
db.execute("SELECT * FROM student WHERE sn = 1")
result =db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Ram Kumar', 78, 89, 67, 90, 67, 400, 80.0, 'A')]

In [6]:
db.execute("SELECT * FROM student WHERE grade = 'A' and per >=85")
result =db.fetchall()
# for x in result:
#     print(x)
result

[(2, 'Shyam', 78, 90, 90, 78, 80, 432, 85.0, 'A'),
 (3, 'Hari', 67, 89, 98, 67, 89, 87, 86.7, 'A')]

In [7]:
# insert data
sql = '''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`,
`english`, `nepali`, `total`, `per`, `grade`) 
VALUES ('7', 'Akash', '89', '78', '76', '90', '87', '420', '85', 'A');'''
db.execute(sql)
database.commit()

In [8]:
name = input("Enter name = ")
physics = float(input("Enter physics = "))
chemistry = float(input("Enter chemistry = "))
math = float(input("Enter math = "))
english = float(input("Enter english = "))
nepali = float(input("Enter nepali = "))
total = physics + chemistry + math + english + nepali
per = total/5
if per >= 80:
    grade = 'A'
elif per >= 60:
    grade = 'B'
elif per >=45:
    grade = 'C'
else:
    grade = 'F'
# insert data
sql = f'''INSERT INTO student (name, physics, chemistry, math,
english, nepali, total, per, grade) 
VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
db.execute(sql)
database.commit()

Enter name = Sabin
Enter physics = 89
Enter chemistry = 98
Enter math = 78
Enter english = 90
Enter nepali = 76

In [9]:
print(sql)

INSERT INTO student (name, physics, chemistry, math,
english, nepali, total, per, grade)
VALUES ('Sabin', 89.0, 98.0, 78.0, 90.0, 76.0, 431.0, 86.2, 'A')

In [10]:
db.execute("SELECT * FROM student")
result =db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Ram Kumar', 78, 89, 67, 90, 67, 400, 80.0, 'A'),
 (2, 'Shyam', 78, 90, 90, 78, 80, 432, 85.0, 'A'),
 (3, 'Hari', 67, 89, 98, 67, 89, 87, 86.7, 'A'),
 (4, 'Akash', 89, 78, 76, 90, 87, 420, 85.0, 'A'),
 (5, 'Akash', 89, 78, 76, 90, 87, 420, 85.0, 'A'),
 (6, 'Anish', 77, 78, 76, 90, 87, 420, 85.0, 'A'),
 (7, 'Akash', 89, 78, 76, 90, 87, 420, 85.0, 'A'),
 (8, 'Sabin', 89, 98, 78, 90, 76, 431, 86.2, 'A'),
 (9, 'Sabin', 89, 98, 78, 90, 76, 431, 86.2, 'A')]

In [27]:
# UPDATE

In [12]:
sql = '''UPDATE student SET name = "Ram" WHERE name = "Ram Kumar" '''
db.execute(sql)
database.commit()

In [18]:
subject = input("Enter subject name = ")
marks = int(input("Enter marks = "))
student_id = int(input("Enter student id = "))

sql = f'''UPDATE student SET {subject} = {marks} WHERE sn = {student_id}'''
db.execute(sql)
database.commit()

Enter subject name = physics
Enter marks = 90
Enter student id = 1

In [19]:
db.execute("SELECT physics,chemistry,math,english,nepali FROM student WHERE sn = 1")
result =db.fetchall()
# for x in result:
#     print(x)
result

[(90, 89, 67, 90, 67)]

In [24]:
suum = sum(result[0])
suum

403

In [28]:
per = suum/5
if per >= 80:
    grade = 'A'
elif per >= 60:
    grade = 'B'
elif per >=45:
    grade = 'C'
else:
    grade = 'F'

sql = f'''UPDATE student SET total = {suum}, per = {per} WHERE sn = {student_id}'''
db.execute(sql)
database.commit()

In [29]:
sql = "DELETE FROM student WHERE grade = 'F'"
db.execute(sql)
database.commit()